{"_id":{"$oid":"5f8b59b2cc15c200178a83c0"},"slug":"xxxx","title":"xxxx","createdIso":{"$date":"2020-10-17T20:53:06.663Z"}}
{"_id":{"$oid":"5a3c16b81721d00014b30fd0"},"slug":"confirmed-email","title":"All Done, your email is confirmed!","bodyContent":"<p>Yup, your email is confirmed and I've added you to the&nbsp;<strong>\"3x Your Learning Speed to Becoming a Developer\"&nbsp;</strong>email course.</p>\n<p>In fact, <strong>check your email one more time</strong>, you should be getting your first lesson, anytime now.</p>\n<p>There is some ninja knowledge in there that will give you an edge in your journey.</p>","createdIso":{"$date":"2017-12-21T20:16:56.42Z"},"createdMsec":1.513887416422E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2020-11-27T20:40:13.657Z"},"updatedMsec":1.531452612426E+12}
{"_id":{"$oid":"5a3c1d071721d00014b30fd3"},"slug":"thanks-3x-learn-speed","title":"Check your inbox","bodyContent":"<p>Over the next few days, I will send you 1 lesson a day, over the course of 7 days, showing you the exact strategies I used to speed up my learning which allowed me to become a web developer in 5 short months. This finally allowed me to land my first job as a software engineer at a Fortune 100 company - United Airlines.</p>\n<p>Fun Fact: I was 25 years old then. Yup, I started late.</p>\n<h4>Here is what to do next:</h4>\n<p>Step 1: Go to your email inbox</p>\n<p>Step 2: Look for an email from \"Aziz at iLoveCoding\"</p>\n<p>Step 3: Click the link in the email, to verify your email address</p>\n<p>You are done. Now you'll start receiving the lessons from me via email</p>\n<p><strong>Note:</strong> Can't find the email? check your spam folder, and be sure to add my email to your contacts. This way you'll always get my emails straight to your inbox.</p>","createdIso":{"$date":"2017-12-21T20:43:51.435Z"},"createdMsec":1.513889031437E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2020-11-27T20:36:08.442Z"},"updatedMsec":1.543451509565E+12}
{"_id":{"$oid":"5b346abddef3152a5d3d4f74"},"slug":"confirmed-perfect-path","title":"All Done, You're in","bodyContent":"<p>Yup, you're email is confirmed and we've added you to the&nbsp;<b>\"3x Your Learning Speed to Becoming a Developer\"&nbsp;</b>email course.</p>\n<p>In fact, <b>check your email one more time</b>, you should be getting your first lesson, anytime now.</p>\n<p>There is some ninja knowledge in there that will give you an edge in your journey.</p>","createdIso":{"$date":"2018-06-28T04:53:29.427Z"},"createdMsec":1.530161736609E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2018-11-29T00:28:45.731Z"},"updatedMsec":1.543451325731E+12}
{"_id":{"$oid":"56217fb15e0ee48a2ad77a15"},"slug":"about","title":"iLoveCoding Story","bodyContent":"<h2>iLoveCoding in 10 seconds:</h2><ol><li>iLoveCoding is the simplest path to becoming a job-ready software developer<br></li><li>Learn via look-over-my-shoulder style video training</li><li>With mentorship (via an online forum and/or live group calls)<br></li><li>iLoveCoding specializes in the worlds most versatile programming language - JavaScript</li><li>iLoveCoding is a coding bootcamp alternative but it is better<br></li></ol><ul><li class=\"ql-indent-1\">...in value (cost)</li><li class=\"ql-indent-1\">...in effectiveness (we keep it real, vs hype or pushing things down your throat)</li></ul><h2>The iLoveCoding Team</h2><p><img src=\"https://a.ilovecoding.org/img/_aziz/azizali-150.jpg\" alt=\"Aziz Ali\" height=\"200\" width=\"200\"></p><h3>Aziz Ali</h3><p><em>Founder &amp; Chief Instructor</em></p><p><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">Aziz Ali is a serial entrepreneur and a self-taught software developer</span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">. Aziz went from someone who literally hated programming to someone who now loves to code. Aziz went from the mindset of “Coding is not for me” to becoming a competent software engineer.&nbsp;</span></p><p><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">Aziz has worked as a senior developer and technical manager at CVS Health (Fortune 10), TE Connectivity&nbsp;</span><span style=\"font-size: 14.4px; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">(Billion dollar company)</span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">, Uptake (AI startup/Fastest Billion dollar company), Press Ganey (Largest Healthcare consulting firm in the USA), and United Airlines to name a few. At these companies, Aziz coded and launched dozens of web and mobile applications which are used by millions of people worldwide.&nbsp;</span></p>&nbsp;&nbsp;<h2>The mission of iLoveCoding:</h2><p><strong>iLoveCoding is on a mission</strong> to get you familiar and then befriend you with coding. So you are empowered to build the ideas you conceive.</p><p><strong>iLoveCoding is on a mission</strong> to make you not into a good developer, but a great developer - someone who is confident in him/her self to take on challenges and build stuff.</p><p><strong>iLoveCoding is on a mission</strong> to develop your problem-solving and critical thinking skills, so you are left resourceful to solve any problem you face.</p><p><strong>iLoveCoding is on a mission</strong> to empower you to build apps on any platform imaginable (Web, mobile, desktop, TV etc.).</p><p><strong>iLoveCoding is on a mission</strong> to give you an alternative to the \"Traditional Education System\". One computer science class at college will not make you job ready; iLoveCoding will</p><p><strong>iLoveCoding is on a mission</strong> to rid you from your insecurities, so you are liberated and called from within to contribute to the world (maybe to an open-source project, volunteer to teach, or simply feed underprivileged children)</p><p><strong>iLoveCoding is on a mission</strong> to challenge you to think big and get acquainted with your calling. Coding is just a means to an end. What is your \"end\"? To ship that app? To teach others? To learn? To build teams?</p><h2>How iLoveCoding got Started</h2><p>In 2012, the startup craze was high, and I (Aziz Ali) decided to launch a technology startup based in Chicago (where I live). I joined and graduated from <a href=\"http://fi.co/\">Founders Institute</a>. Since I am a web guy, I decided that my startup will be web-based. Back then, every startup was using Ruby on Rails to develop their web-app. I thought if it worked for others, it would work for me.</p><p>Being a control freak that I was back then, I decided to learn Rails on my own. Having no background in Ruby or Rails, I read books, did lessons and tried to get a hang of the language and framework. I also hired a few Rails Developers from Pakistan and started coding up my app. I told my developers that they would do the coding and at the same time, they would also have to show me a little bit on what they were doing. I must say, the learning curve was pretty steep. Every feature I wanted to build for my app was a research project. It was not fun.</p><h3>The Ultimate Practical Resource to Build Web Apps with Rails</h3><p>Finally, I discovered this website <a href=\"http://Railscasts.com\">Railscasts.com</a>. I was in heaven. <a href=\"http://Railscasts.com\">Railscasts.com</a> has small video screencasts in which Ryan Bates, the founder of Railscasts.com, would take you from nothing to building a small little feature in Rails. Screencasts about User Login, Content Protection, Accepting Payments, Creating News Feeds, Building a Search Feature, all were there. If I wanted to make a replica of Facebook, Twitter, Wikipedia, or Quora, I could build it out of my learning from RailsCasts.com; one tutorial at a time.</p><p>My startup didn't work out, and right at that time, I was getting interested in Front-End Development and Node JS. Historically JavaScript only ran on the browser, that meant that JavaScript was only good for creating front-end website features that ran on the browser. But with Node JS, JavaScript code could run on the physical computer without the need of a browser. This opened JavaScript to compete with ALL other languages imaginable. Now you could create, Website backend, Desktop applications, TV applications, SmartWatch Applications and even mobile applications with JavaScript. My thought process was; why learn platform-specific languages such as PHP, Python, Ruby, C# etc, when I can learn just ONE language to build apps for every platform. I came to the realization that JavaScript is the ONLY language that qualifies to do that. I decided to go all in with JavaScript.</p><h3>Finding Resources to Learn Full-Stack JavaScript</h3><p>I googled hundreds of times in search for a website that would teach me JavaScript in a way that would make me confident and practically-able to build JavaScript apps. After months of frustrations and trying dozens of tutorials and courses I was still a wannabe programmer. I was looking for a \"<strong>Railscasts.com for JavaScript\" </strong>like resource, that could teach me how to practically build Modern Front-End Websites, Interactive User-Interfaces, and Backend APIs and Systems via JavaScript. I didn't find such a resource. One night I was laying in my bed ready to fall asleep, and it dawned on me, what if there is a website similar to Railscasts.com but for JavaScript, that's what I would gladly pay money for. But there was nothing like it, I had spent months looking for a good resource. I had to scratch my own itch, and at that night the concept and dream of iLoveCoding was born.</p><p><strong>iLoveCoding is for JavaScript what RailsCasts.com is for Rails</strong></p><blockquote>iLoveCoding is the only resource on the Internet that specializes in teaching you JavaScript in a way that makes you a Full-Stack JavaScript Developer fast.</blockquote><p>At iLoveCoding, you will learn the nuts and bolts of JavaScript. jQuery, HTML &amp; CSS. This together will make you a cohesive Front-End Developer. A good front-end developer can command a salary of $50,000 - $80,000 with the above skill set. When you decide to step it up, you can pick-up Node JS and/or Angular JS to jump up your salary range in the $100,000+ range. With Node JS, you will be able to build backend of websites and replace Ruby-on-Rails, PHP, or any other programming language you were using in the backend. Since Node JS is in high demand and also opens up the possibilities of JavaScript usage, this skill will serve you well financially as well as creatively.</p><blockquote>The fact is that its not about learning. Its about practice.</blockquote><p>You need to constantly see how code is written and problems are solved with code. This only comes with experience. However, you can pick up this experience from someone who has been there done that. And that is EXACTLY what the lessons section will help you do. In the Lessons section, you will see how a Photo slider is made, how a web scraper is made, how Back-end APIs are made, how a Calculator is made, etc., and that is what is going to give you the aha moments to really digest the practical and real-world aspects of being a Pro JavaScript Developer. We are on a mission to accelerate the speed at which you go from amateur to Professional JavaScript Developer - Someone who is confident and resourceful to solve any programming task.</p>","createdIso":{"$date":"2015-10-16T22:52:33.704Z"},"createdMsec":1.445035953707E+12,"updatedIso":{"$date":"2019-06-16T03:06:38.123Z"},"updatedMsec":1.543449124528E+12,"active":true,"enabled":true,"subTitle":""}
{"_id":{"$oid":"5642e5424063d0f481d0f9ed"},"slug":"welcome-pro","title":"Congratulations! You are a Pro member","bodyContent":"<p>Now you have access to the full training on iLoveCoding.</p><p>You can track your progress&nbsp;right within the website, and continue from where you left off.</p><p><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">When in doubt, reach us at <a href=\"mailto:support@ilovecoding.org\">Support@iLoveCoding.org</a></span><br></p>","createdIso":{"$date":"2015-11-11T06:50:42.911Z"},"createdMsec":1.447224642913E+12,"updatedIso":{"$date":"2018-11-29T00:21:47.558Z"},"updatedMsec":1.543450907558E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5c747f6e6c70c8001489ba94"},"slug":"walkthrough","title":"Walkthrough of iLoveCoding","subTitle":"How iLoveCoding is organized and how to get the most out of your experience.","bodyContent":"<div class=\"video\">\n<iframe src=\"https://player.vimeo.com/video/314907971?color=ffffff&amp;title=0&amp;byline=0&amp;portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe>\n</div><p><br></p><b>Don't have an account yet?</b><p>Be sure to create a <a href=\"https://ilovecoding.org/signup\">Free Account</a> of iLoveCoding or Join iLoveCoding <a href=\"https://ilovecoding.org/pricing\">Paid Training</a> to enjoy the full benefits.</p><p><b>Already a&nbsp;member?</b> <a href=\"https://ilovecoding.org/login\">Login</a></p>","createdIso":{"$date":"2019-02-25T23:51:10.191Z"},"updatedIso":{"$date":"2019-02-26T00:26:48.694Z"}}
{"_id":{"$oid":"5622cd538795649145fce179"},"slug":"terms","title":"Terms of Service & Terms of Use","bodyContent":"<div><h3>1. Terms</h3><p>By accessing this website, you are agreeing to be bound by these web site Terms and Conditions of Use, all applicable laws, and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this site. The materials contained in this website are protected by applicable copyright and trademark law.</p><h3>2. Use License</h3><ol><li>Permission is granted to temporarily download one copy of the materials (information or software) on I LOVE CODING Inc.'s web site for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license, you may not:</li><li class=\"ql-indent-1\">modify or copy the materials;</li><li class=\"ql-indent-1\">use the materials for any commercial purpose, or for any public display (commercial or non-commercial);</li><li class=\"ql-indent-1\">attempt to decompile or reverse engineer any software contained on I LOVE CODING Inc.'s web site;</li><li class=\"ql-indent-1\">remove any copyright or other proprietary notations from the materials; or</li><li class=\"ql-indent-1\">transfer the materials to another person or \"mirror\" the materials on any other server.</li><li>This license shall automatically terminate if you violate any of these restrictions and may be terminated by I LOVE CODING Inc. at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.</li></ol><h3>3. Disclaimer</h3><ol><li>The materials on I LOVE CODING Inc.'s web site are provided \"as is\". I LOVE CODING Inc. makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, I LOVE CODING Inc. does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its Internet web site or otherwise relating to such materials or on any sites linked to this site.</li></ol><h3>4. Limitations</h3><p>In no event shall I LOVE CODING Inc. or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on I LOVE CODING Inc.'s Internet site, even if I LOVE CODING Inc. or an I LOVE CODING Inc. authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.</p><h3>5. Revisions and Errata</h3><p>The materials appearing on I LOVE CODING Inc.'s web site could include technical, typographical, or photographic errors. I LOVE CODING Inc. does not warrant that any of the materials on its web site are accurate, complete, or current. I LOVE CODING Inc. may make changes to the materials contained on its web site at any time without notice. I LOVE CODING Inc. does not, however, make any commitment to update the materials.</p><h3>6. Links</h3><p>I LOVE CODING Inc. has not reviewed all of the sites linked to its Internet web site and is not responsible for the contents of any such linked site. The inclusion of any link does not imply endorsement by I LOVE CODING Inc. of the site. Use of any such linked web site is at the user's own risk.</p><h3>7. Site Terms of Use Modifications</h3><p>I LOVE CODING Inc. may revise these terms of use for its web site at any time without notice. By using this website you are agreeing to be bound by the then current version of these Terms and Conditions of Use.</p><h3>8. Governing Law</h3><p>Any claim relating to I LOVE CODING Inc.'s web site shall be governed by the laws of the State of Illinois without regard to its conflict of law provisions.</p><p>General Terms and Conditions applicable to Use of a Web Site.</p></div>","createdIso":{"$date":"2015-10-17T22:36:03.965Z"},"createdMsec":1.445121363965E+12,"updatedIso":{"$date":"2018-11-29T00:19:27.526Z"},"updatedMsec":1.543450767526E+12,"active":true,"enabled":true}
{"_id":{"$oid":"581801e05e58ac000fcf7d31"},"slug":"welcome-n-verify","title":"Congratulations you'r a Pro, but wait...","bodyContent":"<p>I want to verify your email, this way my communication with you will be uninterrupted.</p><p><b>Here is how to verify your email:</b></p><ol><li>Go to your email inbox</li><li>Open the email from iLoveCoding</li><li>Click on the link in the email to verify your email address</li><li>Login to iLoveCoding</li></ol>","createdIso":{"$date":"2016-11-01T02:45:52.244Z"},"createdMsec":1.477968352246E+12,"updatedIso":{"$date":"2020-12-02T03:31:57.367Z"},"updatedMsec":1.477968352247E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5c6f49c6ce89f40014a38672"},"slug":"affiliates","title":"CLOSED: Become an Affiliate ","subTitle":"Earn 30% Commission. Earn a living.","bodyContent":"<p>Promote iLoveCoding Education and make a side-income or a full-time living.</p>\n<p><a href=\"https://checkout.ilovecoding.org/full-stack-mastery/partner/\">Become an iLoveCoding Affiliate</a></p>\n<h2>iLoveCoding Affiliate Program Benefits</h2>\n<p>Enjoy the following benefits of the iLoveCoding Affiliate Program:</p>\n<ul>\n  <li>Earn a generous 30% commission on the sale.</li>\n  <li>Get paid monthly. Minimum 30-days after the sale.</li>\n  <li>Get your own unique affiliate code.</li>\n  <li>Get your own custom discount coupon.</li>\n  <li>Tracking cookie never expires: Meaning you get credit for the sale even if the customer buys after a long time.</li>\n  <li>Affiliate Favoring Cookie Settings\n    <ul>\n      <li>The affiliate link uses the last-cookie system. Meaning the last visited affiliate link gets the credit for the sale.</li>\n      <li>Track your promotion statistics in our Affiliate Management system.</li>\n    </ul>\n  </li>\n</ul>\n\n<h2>How much money can you make?</h2>\n<p>iLoveCoding Full-Stack Mastery training program is priced at <strong>$99</strong>. When you make a sale, you earn <strong>30% commission</strong> which is <strong>$29.70 per sale</strong>.</p>\n<p>Here is a tabular view of your earnings:</p>\n<table border=\"1\">\n  <thead>\n    <tr>\n      <th style=\"padding: 5px; text-align:center\"># of sales per day</th>\n      <th style=\"padding: 5px; text-align:center\">Commission calculation</th>\n      <th style=\"padding: 5px; text-align:center\">Total commission earned per day</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">1</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 1</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">5</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 5</td>\n      <td style=\"padding: 5px; text-align: center;\">$148.50</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">10</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 10</td>\n      <td style=\"padding: 5px; text-align: center;\">$297.00</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">15</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 15</td>\n      <td style=\"padding: 5px; text-align: center;\">$445.50</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">20</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 20</td>\n      <td style=\"padding: 5px; text-align: center;\">$594.00</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">25</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 25</td>\n      <td style=\"padding: 5px; text-align: center;\">$742.50</td>\n    </tr>\n    <tr>\n      <td style=\"padding: 5px; text-align: center;\">30</td>\n      <td style=\"padding: 5px; text-align: center;\">$29.70 X 30</td>\n      <td style=\"padding: 5px; text-align: center;\">$891.00</td>\n    </tr>\n  </tbody>\n</table>\n<br/>\n<p>When a customer purchases additional products along the same checkout process, you earn additional commission.</p>\n\n<p><strong>Note:</strong> Our affiliate management technology is powered by Thrive Cart. This helps us track sales and provide transparency between us and our affiliates (you).</p>\n\n<p class=\"t-center\"><a class=\"btn btn-lg btn-blue\" href=\"https://checkout.ilovecoding.org/full-stack-mastery/partner/\">Become an iLoveCoding Affiliate</a></p>","createdIso":{"$date":"2019-02-22T01:00:54.84Z"},"updatedIso":{"$date":"2023-02-13T03:09:45.303Z"}}
{"_id":{"$oid":"5622cc0c8795649145fce178"},"slug":"journey","title":"Announcements & Journey","bodyContent":"<div class=\"alert alert-warning\"><b>Note:</b> This page is no longer maintained!</div>\n<p><b>We know it's going to be a journey, a journey to inspire people, a journey with obstacles, a journey with joy, tears, and love. If its a journey worth embarking, its a journey worth recording</b></p><p>See our&nbsp;<a href=\"#log\" style=\"background-color: rgb(255, 255, 255);\">Journey Log</a>&nbsp;<span>and our&nbsp;</span><a href=\"#emailarchive\" style=\"background-color: rgb(255, 255, 255);\">Email Broadcast achieve</a></p><h2><a>&nbsp;</a>iLoveCoding Journey &amp; Milestones&nbsp;Log</h2><ul><li>May 19, 2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/custom-filters/\">Custom Filters</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/custom-directives/\">Custom Directives</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/code-structure/\">Structuring Your Angular JS App</a></li></ul></li></ul><p>May 14, 2015 – Launched Lessons</p><ul><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/filter/\">Built-in Filters in Angular JS – Part 1</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/filters-part2/\">Built-in Filters in Angular JS – Part 2</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/routing-templates-spa/\">Routing, Templates &amp; Building Single Page Application with Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/service-factory/\">Service &amp; Factory in Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/sharing-data-controllers/\">Sharing Data Between Controllers in Angular JS</a></li></ul><ul><li>May 05 2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/data-binding/\">Data Binding &amp; Common Directives in Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/action-directives/\">ng-change, ng-click, ng-dbl-click, ng-submit in Angular JS</a></li></ul></li></ul><ul><li>May 04 2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/\" target=\"_blank\">Learn Angular JS in 14 days</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/pillars/\">Building Blocks and Pillars of Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/controllers/\">Controllers &amp; Separating Concern in Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/scope/\">$scope vs. ‘this’ and ‘controller as’ syntax</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/ng-repeat/\">ng-repeat in Angular JS</a></li><li><a href=\"https://ilovecoding.org/courses/learn-angular-js-in-14-days/todo-app/\">Build a Todo App with Angular JS</a></li></ul></li></ul><ul><li>April 20,&nbsp;2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/grid-2/\" target=\"_blank\">Understanding Grid System of Bootstrap – Part 2</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/making-a-full-website-skeleton-with-bootstrap/\">Making a Full Website Skeleton with Bootstrap</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/themes/\" target=\"_blank\">Making Custom Themes for Bootstrap without LESS</a></li></ul></li></ul><ul><li><ul><li>April 14,&nbsp;2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/\" target=\"_blank\">Learn &amp; Master Bootstrap in a Week</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/text/\">Learn the Typography Classes in Bootstrap</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/forms/\">Making Forms with Bootstrap</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/icons/\">Learning to use Bootstrap &amp; Font Awesome Fonts</a></li><li><a href=\"https://ilovecoding.org/courses/learn-bootstrap/components/\">Getting Comfortable with Bootstrap Components</a></li><li><a href=\"https://ilovecoding.org/tutorials/media-query-best-practices/\" target=\"_blank\">Best Practices when Writing Media Query</a></li></ul></li></ul></li></ul><ul><li>April 01,&nbsp;2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/tutorials/css-pseudo-class-selectors/\">CSS Pseudo Class Selectors</a></li><li><a href=\"https://ilovecoding.org/tutorials/parallax-scrolling/\">Parallax Scrolling</a></li><li><a href=\"https://ilovecoding.org/tutorials/load-page-elements-when-scrolled-to-that-area/\">Load Page Elements when Scrolled to that Area</a></li><li><a href=\"https://ilovecoding.org/tutorials/media-query/\">Media Query</a></li></ul></li></ul><ul><li>Mar 25, 2015 – Launched Lessons<ul><li><a href=\"https://ilovecoding.org/tutorials/self-invoking-anonymous-function/\">Self Invoking Anonymous Function: What is it? &amp; Why and How to Use It</a></li></ul></li></ul><ul><li>Mar 24, 2015 - Launched Lessons<ul><li><a href=\"https://ilovecoding.org/tutorials/fullscreen-video-in-background/\">Full-Screen Background Video</a></li><li><a href=\"https://ilovecoding.org/tutorials/difference-between-method-and-function/\">Difference Between Functions and Methods in JavaScript</a></li><li><a href=\"https://ilovecoding.org/tutorials/create-a-simple-drop-down-menu-with-css/\">Create a Simple Drop Down Menu with CSS</a></li></ul></li><li>Mar 09, 2015 - Launched Lessons <a href=\"https://ilovecoding.org/tutorials/dns/\">Domain Name Server</a></li><li>Mar 07, 2015 - Moved web hosting to <a href=\"https://ilovecoding.org/bladewp\">BladeWP</a></li><li>Feb 28, 2015 - Moved video hosting to <a href=\"https://vimeo.com/pro\">Vimeo Pro</a></li><li>Feb 24, 2015 - Introduced 7-Day free trial</li><li>Feb 20, 2015 - Increased Pricing to $9/month</li><li>Dec 12, 2014 - Upgraded to <a title=\"Mailchimp\" href=\"https://iLoveCoding.org/mailchimp\">MailChimp</a> for email marketing</li><li>Dec 12, 2014 - Upgraded web hosting from <a title=\"Bluehost\" href=\"https://ilovecoding.org/bluehost\">Bluehost Starter Plan</a> to <a href=\"https://ilovecoding.org/bluehost\">Bluehost Business Plan</a></li><li>Dec 26, 2014 - Temporary Reduced Pricing to $5/month</li><li>Dec 03, 2014 - Price test $10/month</li><li>Oct 19, 2014 - iLoveCoding mentioned on <a title=\"Erli Bird iLoveCoding listing\" href=\"http://erlibird.com/go/ilovecoding\">Erli Bird</a> &amp; <a title=\"Pineapple\" href=\"http://pineapple.io/resources/ilovecoding\">Pineapple.io</a></li><li><strong>Oct 19, 2014 - iLoveCoding launched</strong></li></ul><h2><a>&nbsp;</a>Weekly Email Archive</h2><ul><li>Wed, May 20, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=1017313\">Weekly Update 5/19/2015</a></li><li>Tue, May 05, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=1006557\">Weekly Update 5/5/2015</a></li><li>Tue, Apr 21, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=989581\">Weekly Update 4/21/2015</a></li><li>Tue, Apr 14, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=981685\">Weekly Update 4/14/2015</a></li><li>Thu, Apr 02, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=967989\">Weekly Update 4/2/2015</a></li><li>Wed, Mar 25, 2015 -&nbsp;<a title=\"Campaign Name\" href=\"https://us3.admin.mailchimp.com/campaigns/show?id=959349\">Weekly Update 3/25/2015</a></li><li>Thu, Mar 19, 2015 - &nbsp;<a title=\"Campaign Name\" href=\"http://us3.campaign-archive1.com/?u=0bf351e3ad180589cd43cdefb&amp;id=ff34c02d87\">Weekly Update 3/19/2015</a></li><li>Sat, Mar 14, 2015 - &nbsp;<a title=\"Campaign Name\" href=\"http://us3.campaign-archive2.com/?u=0bf351e3ad180589cd43cdefb&amp;id=7f8d284703\">Weekly Update 3/14/2015</a></li><li>Thu, Mar 05, 2014&nbsp;- <a href=\"http://us3.campaign-archive2.com/?u=0bf351e3ad180589cd43cdefb&amp;id=51d343583a\">Weekly Update 3/5/2015</a></li><li>Fri, Feb 20, 2015 - <a href=\"http://us3.campaign-archive2.com/?u=0bf351e3ad180589cd43cdefb&amp;id=158de789a9\">&lt; 23 hrs left</a></li><li>Fri, Feb 20, 2015 - <a title=\"Campaign Name\" href=\"http://us3.campaign-archive1.com/?u=0bf351e3ad180589cd43cdefb&amp;id=7aca5d02fd\">Weekly Update 2/20/2015</a></li><li>Wed, Feb 11, 2015 - <a href=\"http://us3.campaign-archive1.com/?u=0bf351e3ad180589cd43cdefb&amp;id=a05e2b1e5f\">Weekly Update 2/11/2015</a></li><li>Wed, Feb 04, 2015 - <a href=\"http://us3.campaign-archive2.com/?u=0bf351e3ad180589cd43cdefb&amp;id=94d1402ed8\">Weekly Update 2/04/2015</a></li><li>Fri, Dec 26th, 2014 -&nbsp;<a href=\"http://us3.campaign-archive2.com/?u=0bf351e3ad180589cd43cdefb&amp;id=a856265b53\">Price Change Announcement</a></li></ul>","createdIso":{"$date":"2015-10-17T22:30:36.142Z"},"createdMsec":1.445121036143E+12,"updatedIso":{"$date":"2018-11-29T00:18:34.271Z"},"updatedMsec":1.543450714271E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5b3472ebdef3152a5d3d4f75"},"slug":"thankyou-perfect-path","title":"Learning how to code is NOT complicated","bodyContent":"<div class=\"col-md-8\">\n  <p class=\"lead\">It does not matter what everyone is saying.</p>\n  <p class=\"lead\">It does not matter what you have experienced in the past.</p>\n  <p class=\"lead\">Things will be different starting right here!</p>\n  <p class=\"lead\">I am pumped ⛽ that you joined this Free Email Course.</p>\n\n  <h2>Here is what to do next...</h2>\n  <hr>\n  <h4>New to iLoveCoding?</h4>\n  <p>If you are new to iLoveCoding and you are subscribing to my email list for the first time, go to your inbox and <strong>Confirm your email.</strong></p>\n  <p>Once done, you will receive lesson #1 immediately via email.</p>\n  \n  <hr>\n  <h4>Already on the list?</h4>\n  <p>If you are already on my email list: lesson #1 should arrive in your inbox at any moment :-)</p>\n\n  <p class=\"lead text-center alert alert-primary\">So what are you doing here? Go to your inbox and get started...</p>\n\n  <p>\n    <strong>Can't find my email to you?</strong> 😠 Spam filters can be stupid sometimes. No worries, check your spam folder, and be sure to add my email to your contacts. This way you'll always get my emails straight to your inbox.</p>\n</div>","createdIso":{"$date":"2018-06-28T04:53:29.427Z"},"createdMsec":1.530161736609E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2018-11-29T00:28:05.565Z"},"updatedMsec":1.543451285569E+12}
{"_id":{"$oid":"5804632c7daddc000f7c7199"},"slug":"invite-email-confirmed","title":"All Done, You're on the list","bodyContent":"<p style=\"text-align: center;\">Yup, I have added you to the &#34;<b>Invite list&#34;</b></p><p style=\"text-align: center;\">In fact, <b>check your email one more time</b>, I have a free gift in it</p><p style=\"text-align: center;\">I have sent you some ninja knowledge that will give you an edge in your journey.</p><p style=\"text-align: center;\"><br/></p><p style=\"text-align: center;\"><br/></p><p style=\"text-align: center;\"><br/></p><p style=\"text-align: center;\"><br/></p><p style=\"text-align: center;\"><br/></p>","createdIso":{"$date":"2016-10-17T05:35:40.392Z"},"createdMsec":1.476682540392E+12,"updatedIso":{"$date":"2016-12-20T04:51:45.663Z"},"updatedMsec":1.482209505663E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5c4cf7ec3253c4a6f65beeb2"},"slug":"confirm","title":"🎉 Congrats on getting started!","subTitle":"Now one last step... See how to get the most out of iLoveCoding (Watch the video)","bodyContent":"<div class=\"row\">\n<div class=\"col-12 col-md-4\">\n<p>I am so pumped ⛽ that you created your iLoveCoding account.</p><p>Now I want you to take a few minutes and watch this short video I have created so you can get the most out of your iLoveCoding account:</p>\n</div>\n<div class=\"col-12 col-md-8\">\n<div class=\"video\">\n<iframe src=\"https://player.vimeo.com/video/314907971?color=ffffff&amp;title=0&amp;byline=0&amp;portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe>\n</div>\n</div>\n</div>\n<p><br><b>Done with the&nbsp;video above?</b> Now head over to your email inbox; You should have received an email from me; Confirm your email to activate your account and let's get started.</p>","createdIso":{"$date":"2019-01-27T00:14:36.406Z"},"updatedIso":{"$date":"2019-02-01T22:43:50.032Z"}}
{"_id":{"$oid":"581803cd5e58ac000fcf7d32"},"slug":"welcome","title":"🎉 Congratulations! Your purchase is complete","bodyContent":"<p>I want to personally welcome you to iLoveCoding Training Program,</p> <p>Trust me, you have made a fine decision to embark on this journey, the results of which will pay you handsome dividends in many years to come in your career as well as in your personal life.</p> <p>With this training, your brain will perform more efficiently and with more clarity.</p> <p>You will break down problems in more manageable chunks and solve them with relative ease.</p><h3>Now let's get started:</h3><p>If you are totally new to iLoveCoding, <b>go to your email inbox</b>, check for an email from iLoveCoding, and <b>Activate your account</b></p><p>If you are an existing iLoveCoding member who just upgraded your account, <a href=\"https://ilovecoding.org/login\">proceed to Login</a></p>","createdIso":{"$date":"2016-11-01T02:54:05.371Z"},"createdMsec":1.477968845372E+12,"updatedIso":{"$date":"2019-02-01T16:48:23.699Z"},"updatedMsec":1.543450988041E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5af2449529a91f0014065ac4"},"slug":"email-me-confirmed","title":"Got it, I'll continue to email you","bodyContent":"<p>Thanks for clicking the link from your email.</p><p>I am glad you want to continue to hear from me.</p><p>Noted :-)</p>","createdIso":{"$date":"2018-05-09T00:45:09.892Z"},"createdMsec":1.525826709893E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5b5f44003320d70014c9f0ed"},"slug":"why-javascript","title":"Why JavaScript?","bodyContent":"<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/326670143?color=1772f2&amp;title=0&amp;byline=0&amp;portrait=0\" width=\"640\" height=\"480\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n\n<p>I want to make the case that JavaScript should be your first programming language, if you want to build awesome apps and enter into the profitable world of software development.</p><p>You see, there are dozens of programming languages. The popular ones are <b>Java</b>, <b>C#</b>, <b>C</b>, <b>C++</b>, <b>JavaScript</b>,&nbsp;<b>Python</b>, <b>Ruby</b>, and <b>PHP</b>. So what makes one better than the other and why can't we just have one programming language? So we don't even have to worry about making a choice.</p><p>Well, we wish that!</p><p>Programming languages are no different than human languages. We have Urdu, English, Mandarin Chinese, Spanish, Arabic, and Hindi, to name a few. They all were created at a different point in time for their own local purposes.</p><p>Programming languages also are invented for a specific kind of problem the programmer is trying to solve.</p><p>For instance, PHP was specifically developed for web development. Java was created with the goal of cross-platform application development, and Ruby was created on the ideology of a simple coding style.</p><p>Overtime programming languages are adopted by developers and they evolve overtime.</p><p>Developers choose to use programming languages in their own ways and start improving them. Just the way a human language evolves naturally by the contribution of its speakers, similarly a programming language evolves for better or for worse by the developers who use and contribute to it.</p><h2>How JavaScript got started...</h2><p>JavaScript was started as a browser-based language and was quickly thrown together by Brendan Eich, the then employee of Netscape Browser, in mere 10-days. Since it was created in a hurry to meet deadlines and fight the browser competition, JavaScript was not that good.</p><p>It was not respected by the developer community and quite frankly was not understood.</p><p>Lack of understanding of JavaScript lead to poor usage, which led to bad software which fed the disliking of JavaScript among developers.</p><p>Years went by, JavaScript was ignored, but the web, internet, and the usage of browsers grew. The more the internet got popular, the more JavaScript became a necessary language for companies who wanted to survive in the web world.</p><p>Slowly but surely developers and corporations started to take JavaScript seriously and started to improve the language.&nbsp;</p><p>JavaScript matured quickly and soon JavaScript evolved to be a language that was not only used in the browser, but also on servers, mobile apps, TVs, embedded systems and desktop apps.</p><h2>#1. How popular is JavaScript Today?</h2><blockquote class=\"blockquote\">Today JavaScript the #1 programming language <br>\n<span class=\"blockquote-footer\"><a href=\"https://insights.stackoverflow.com/survey/2018/#most-popular-technologies\">Stack Overflow Survey 2018</a></span></blockquote><img class=\"img-fluid border\" src=\"https://a.ilovecoding.org/img/why-javascript/compare-prog-lang-stackoverflow.png\" alt=\"\">\n\n<p>Source:&nbsp;<a href=\"https://insights.stackoverflow.com/survey/2018/#most-popular-technologies\" title=\"Stack Overflow Developer Survey 2018\">https://insights.stackoverflow.com/survey/2018/#most-popular-technologies</a></p><p></p><ol><li>JavaScript is the most popular programming language - 71.5%</li><li>Java is a far second - 45.4%</li><li>Python is on third position - 37.9%</li></ol><p>If that is not definitive enough, let me add:</p><p><i>\"For the <b>sixth year in a row</b>, JavaScript is the most commonly used programming language.\"</i></p><p>Again I am referencing this information from <a href=\"https://insights.stackoverflow.com/survey/2018/#most-popular-technologies\">Stack Overflow Developer Survey</a></p><p><b>What does it mean to be popular?</b></p><p>Popularity means that JavaScript is being used in a lot of places.</p><p>Popularity also means that there are more people (developers) working on JavaScript than other programming languages.</p><p>Just because JavaScript is popular is not enough for me to suggest that you should pick JavaScript as a programming language to learn.</p><p>Here is my second case:</p><h2>#2. You can build anything and everything with JavaScript</h2><p>In <a href=\"https://ilovecoding.org/courses/perfect-path\">The Perfect Path to becoming a Job-Ready Developer</a> course, I share with you the <a href=\"https://ilovecoding.org/courses/perfect-path/lessons/dev-type\">9 main areas of software development</a>, these are:</p><p></p><ol><li>Compiler</li><li>Embedded Systems</li><li>Operating Systems</li><li>Data Science</li><li>Video Game Development</li><li>Dev Ops</li><li>Desktop Applications</li><li>Mobile Applications</li><li>Web Applications</li></ol><p>Different programming languages are used in different areas of software development, and the awesome thing about JavaScript is that it is used in more areas than any other programming language.</p><p>Among the 9 areas, here is where JavaScript is used:</p><ol><li>Compiler</li><li>Embedded Systems&nbsp;✅<b>- A little</b></li><li>Operating Systems</li><li>Data Science&nbsp;✅<b>- A little</b></li><li>Video Game Development ✅</li><li>Dev Ops</li><li>Desktop Applications ✅</li><li>Mobile Applications ✅</li><li>Web Applications&nbsp;✅<b>- A lot</b></li></ol><p></p><p></p>\n<p>This means that you can build more kinds of software with your knowledge of JavaScript than any other programming language.</p><p>Here is a quick table to compare different programming&nbsp;languages and their capabilities.</p><p><img class=\"img-fluid border\" src=\"https://a.ilovecoding.org/img/why-javascript/compare-lang-capability.jpg\" alt=\"Compare JavaScript Capability with other programming languages\"><br></p><p>You see...</p><ul><li>PHP can only be used for website backends</li><li>Python is mostly used for Data Scient and website backend</li><li>Ruby is used for scripts and website backends</li><li>JavaScript is used in Web Front-End, Back-End, Mobile, Desktop, and even TV apps&nbsp;</li></ul><h2>#3. JavaScript is used by major corporations in a major way.</h2><p>Sure sure, JavaScript is popular and has more capability, but is it really used by the big boys?</p><p>Here are a few companies who use JavaScript in a major way:</p><p></p><ul><li>Walmart &amp; LinkedIn built their website backend with JavaScript</li><li>Facebook, Instagram and Tesla mobile apps are built with JavaScript</li><li>Microsoft VS Code, Slack, Skype Desktop apps are built with JavaScript</li><li>Every major corporation's website uses JavaScript - Youtube, Google, Amazon, Netflix, Coca Cola, Apple, etc</li></ul><p></p><p>Here are some more companies who use JavaScript in a major way:</p><img class=\"img-fluid border\" src=\"https://a.ilovecoding.org/img/why-javascript/js-apps-in-fe-be-mobile-desktop.jpg\" alt=\"Companies using JavaScript to build their app and software\"><p>If it's good enough for the big guys, I feel it should be good enough for me.</p><p>But just to keep the record straight, a fair question is ask is - Is JavaScript fast?</p><h2>#4. JavaScript is fast according to many benchmarks</h2><p>Performance is a complicated topic. It's very common for newbies to do countless google searches to see which programming language is fast so they can build their apps using the fastest programming language. I know this because I did when I was starting off and I find many of my students do the same.</p><p>Here is the real answer.</p><p>You can NOT compare the programming languages' performance speed in isolation. Performance benchmarks of programming languages are done in the context in which the programming language is used.</p><p>Comparing the speed of speaking English and speaking Chinese is a stupid and pointless comparison. Same applies for programming languages.</p><p>So what does it mean when we talk about the&nbsp;performance of a programming language?</p><p>Since a programming language can be used in different environments, use cases and for different purposes, some features of a programming language may work faster in some areas, and it may be slower in others.</p><p>For example, when building high-frequency trading apps, programmers use C programming language because it gives low-level capability to shred time. Using C for a web application would be an overkill.</p><p>Tips for newbies: \"Stop searching which programming language is the fastest\"</p><p>It's not a useful question to ask.</p><p>However, if you know the purpose of your application then it is very helpful to research which programming language will suit your purpose and then build your application with it. Such research takes a lot of time, and this should be left for the pros. Not newbies.</p><p>When PayPal was adopting JavaScript, they documented on their blog how their app performance increased when they <a href=\"https://www.paypal-engineering.com/2013/11/22/node-js-at-paypal/\">switched from Java to JavaScript</a>.</p><p>I share this, just to debunk the&nbsp;phrase \"x language is slow\"</p><h3>#5. JavaScript is in demand<br></h3><p>Programming, in general, is in demand these days but particularly website front-end development is in high demand. Guess which programming language is used in Front-End Development? JavaScript.</p><p>The good news for you is that there are not many skilled JavaScript developers in the market, this makes it easier for newer developers to quickly get a job. Employers are forgiving because they need these skilled people&nbsp;who are difficult to find. Once you have the right skills, getting a job is easier.</p><h3>#6. JavaScript developers are paid well<br></h3><p>Developers in general, are paid well due to the technical nature of their work. Plus businesses&nbsp;need developers for their survival.</p><p>Here are a few public stats on the pay of a JavaScript developer.</p><ul><li><a href=\"https://www.indeed.com/salaries/JavaScript-Developer-Salaries\">$111,836/year according to indeed</a></li><li><a href=\"https://www.glassdoor.com/Salaries/front-end-web-developer-salary-SRCH_KO0,23.htm\">$77,908/year according to glassdoor</a></li><li><a href=\"https://stackoverflow.com/jobs/salary/results?l=Chicago%2c+IL%2c+United+States&amp;ed=1&amp;ex=4&amp;ff=1&amp;dr%5B0%5D=FullStackDeveloper&amp;tl%5B0%5D=javascript\">$87,000/year according to Stack Overflow</a></li></ul><p>More or less JavaScript developers are paid equally well as a programmer with other skills. It goes without saying that these numbers grow with your skill and experience.</p><p>The supply (# of developers) and demand (# of job positions) ratio of the JavaScript market is in the favor of developers these days, hence landing a job is much easier.</p><h3>#7. JavaScript is a must for web development</h3><p>JavaScript is the only programming language used to build website interfaces. 99% of all top websites use JavaScript and more and more mobile and desktop apps are being built with it too.</p><p>If you want to establish your career as a web developer, you have to learn and master JavaScript.</p><h2>Conclusion: Choose JavaScript</h2><p>When choosing a programming language to learn, the number one factor to consider is what is your goal?<br></p>\n<p></p><ul><li>Do you want to build websites, web apps, mobile apps?</li><li>Do you want to enter the world of software development and pursue this career?</li><li>Do you want to make games?</li><li>Do you want to make artificial intelligence models?</li></ul><p></p>\n<p><strong>What is your goal?</strong></p>\n<p>The answer you give to the above will determine which programming language you should pick.</p>\n<p>Now if you are lost and undecided on the above questions, you can still make a good decision into picking the right programming language.</p>\n<p>When considering which programming language to learn here are the 4 factors you should consider:</p>\n<ol>\n<li>Capability - What can I build with it?</li>\n<li>Income - How much can I earn / How easy is it to get a job?</li>\n<li>Future - Will it remain relevant in the future?</li>\n<li>Difficulty - How difficult/easy is it to learn and master?</li>\n</ol>\n<p>Considering everything, including the stats and facts we discussed earlier in this post, JavaScript should be your first programming language.</p><p>Here at iLoveCoding, I take you from knowing nothing to becoming a competent Job-ready + build-your-ideas ready JavaScript Developer. You get bootcamp level training, at the fraction of the cost.</p>","createdIso":{"$date":"2018-07-30T16:59:44.621Z"},"createdMsec":1.532969984621E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2020-08-22T00:07:10.525Z"},"updatedMsec":1.543451080482E+12,"subTitle":"Half of your battle is won when you pick the right programming language."}
{"_id":{"$oid":"5622cb198795649145fce176"},"slug":"presskit","title":"Press Kit","bodyContent":"<h3 style=\"text-align: left;\">iLoveCoding is the simplest path to learn JavaScript development</h3> <p>iLoveCoding is the only resource on the Internet that specializes in teaching you JavaScript in a way that makes you a Front-End and Full-Stack JavaScript Developer. We're committed to delivering the best learning experience. We teach students how to code so they can build practical and meaningful apps, land respectable jobs, and build their own tech companies.</p> <h3>How it works</h3> <p>On iLoveCoding, students don't just learn the concepts but they implement their learning by actually building things, real-world applications, web applications, mobile applications, games etc. Coding sites give you badges and points and you're left wondering \"where do I start?\" iLoveCoding is different from any other learning experience. At iLoveCoding, you will learn the nuts and bolts of JavaScript, jQuery, HTML &amp; CSS. This together will make you a cohesive Front-End Developer. There are two sections in iLoveCoding, <a href=\"https://ilovecoding.org/playlists\" target=\"\">Courses&nbsp;</a>and Lessons. In Courses section, you learn the fundamentals of programming and in the Lessons section, you will see how a Photo slider is made, how a web scraper is made, how back-end APIs are made, how a Calculator is made, etc. And that is going to give you the aha moments to really digest the practical and real-world aspects of being a Pro JavaScript Developer.</p> <p><a href=\"https://ilovecoding.org/about/\" target=\"_blank\" rel=\"noopener\">Company History</a><br><a href=\"https://ilovecoding.org/about-aziz-ali/\" target=\"_blank\" rel=\"noopener\">Founder <a href=\"https://ilovecoding.org/pages/aziz-ali\"></a>of iLoveCoding</a></p> <h3>In writing</h3> <p>Write iLoveCoding&nbsp;in plain text:</p> <p>The “i” in iLoveCoding&nbsp;is always lowercase.<br>The “L” and “C” in iLoveCoding&nbsp;is always capitalized.</p> <p><span style=\"font-size: 14.4px; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">iLoveCoding&nbsp; &nbsp; &nbsp;- <b>correct</b><br></span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">I Love Coding &nbsp; -&nbsp;wrong<br></span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">i love coding &nbsp; &nbsp; -&nbsp;wrong<br></span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">ilovecoding &nbsp; &nbsp; &nbsp; -&nbsp;wrong<br></span><span style=\"font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">ILOVECODING&nbsp; - wrong</span></p> <h4>iLoveCoding brand logos</h4> <p><a href=\"//a.ilovecoding.org/img/_logos/ilovecoding-logos-presskit.zip\" target=\"_blank\" rel=\"noopener\">Download all logos in PNG and SVG Vector Formats</a></p> <p>Logo icon with a background color<br><img src=\"//a.ilovecoding.org/img/_logos/icon-bg-curved-400.png\" alt=\"iLoveCoding logo with transparent background\"></p> <p>Logo icon with transparent background<br><img class=\"repeat-box-pattern\" src=\"//a.ilovecoding.org/img/_logos/icon-400.png\" alt=\"iLoveCoding logo Icon with surved background border\"></p> <p>Full logo icon with a background color<br><img style=\"max-width: 700px; width: 100%;\" src=\"//a.ilovecoding.org/img/_logos/logo-bg-700.png\" alt=\"iLoveCoding logo with transparent background\"></p> <p>Full logo icon with transparent background<br><img class=\"repeat-box-pattern\" style=\"max-width: 700px; width: 100%;\" src=\"//a.ilovecoding.org/img/_logos/logo-700.png\" alt=\"iLoveCoding logo with background color\"></p><p><span style=\"text-align: center; font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Helvetica Neue&quot;, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-size: 0.9rem;\">More questions? Feel free to email at <a href=\"mailto:support@ilovecoding.org\">support@ilovecoding.org</a></span></p>","createdIso":{"$date":"2015-10-17T22:26:33.408Z"},"createdMsec":1.445120793408E+12,"updatedIso":{"$date":"2018-11-29T00:07:31.641Z"},"updatedMsec":1.543450051641E+12,"active":true,"enabled":true}
{"_id":{"$oid":"58045d127daddc000f7c7198"},"slug":"thankyou-invite","title":"An invitation to iLoveCoding will be coming your way shortly. Meanwhile..","bodyContent":"<p><span>Check your inbox. I sent you an email with a verification link. Click on that link to confirm your email address.</span><br/></p><p><b><i>Once you confirm your email, I'll be sure that you receive your invitation.</i></b></p><p>We are working hard to find you a spot in the next coming days.<br/>In the next 5 days, you will get a private invite to join iLoveCoding Pro</p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p><br/></p>","createdIso":{"$date":"2016-10-17T05:09:38.247Z"},"createdMsec":1.476680978248E+12,"updatedIso":{"$date":"2016-12-20T04:52:11.666Z"},"updatedMsec":1.482209531666E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5df56cd3f2a4b68630fdd250"},"slug":"thanks-webinar-signup","title":"Congrats! You're registered for the Webinar","subTitle":"Check your email immediately, your unique link is waiting","bodyContent":"<p style=\"text-align: center;\"><img src=\"http://i.giphy.com/3o6Zt7mutmbv76m0ko.gif\" style=\"width: 50%;\"></p>\n<p>\nI am super pumped that you requested access to the Developer Fast Track Webinar. <br>\nHere is what you need to do next:\n</p>\n<ol>\n<li>Go to your email inbox</li>\n<li>Look for an email from me - <strong>Aziz at iLoveCoding</strong></li>\n<li>If you are new to iLoveCoding, you'll receive an email to \"confirm your email\"</li>\n<li>Once your email is confirmed, I'll send you a second, this time with the link to access the webinar</li>\n<li>Click the link, and your webinar will start</li>\n</ol>\n<p>\n<strong>IMPORTANT:</strong> The link to the training is time sensitive, so be sure to watch it before it expires.\n</p>\n<p>\nThanks it, enjoy the training :-)\n</p>\n<p>\nYour software development guide<br>\nAziz Ali<br>\nCreator of iLoveCoding\n<p>\n","createdIso":{"$date":"2019-12-14T23:14:27.095Z"},"updatedIso":{"$date":"2019-12-15T00:24:03.403Z"}}
{"_id":{"$oid":"5622cbb98795649145fce177"},"slug":"aziz-ali","title":"Aziz Ali, Founder of iLoveCoding","bodyContent":"<h2><img class=\"circular\" src=\"https://a.ilovecoding.org/img/_aziz/azizali-150.jpg\" alt=\"Aziz Ali Profile Picture\" width=\"150\" height=\"150\"></h2>\n<p>I, Aziz Ali, am a Serial Entrepreneur, Geek, and a Learn-a-holic. I went from someone who literally hated programming to someone who now loves to code. Aziz went from the mindset of \"Coding is not me\" to becoming a Great coder, and now I welcome any coding challenge.</p>\n<ul>\n  <li>I have launched over 100 websites</li>\n  <li>Worked with Fortune 50 Companies</li>\n  <li>Developed the United Airlines Airport Terminal Application</li>\n  <li>Developer Mobile Web Apps for CVS Health</li>\n  <li>Developed and Launched over a dozen Responsive Mobile Websites</li>\n  <li>and much more</li>\n  <li>- All via JavaScript and its awesome frameworks.</li>\n</ul> <h3 style=\"text-align: center;\">A few companies Aziz has worked at:</h3>\n<p><img src=\"https://a.ilovecoding.org/img/cvs-caremark-logo.jpg\" alt=\"cvs-caremark-logo\"></p>\n<p><img src=\"https://a.ilovecoding.org/img/home-helpers-logo.png\" alt=\"home-helpers-logo\"></p>\n<p><img src=\"https://a.ilovecoding.org/img/te-connectivity-logo.png\" alt=\"te-connectivity-logo\"></p>\n<p><img src=\"https://a.ilovecoding.org/img/united-logo-230x42.png\" alt=\"united-logo\"></p>\n<h2>How I Went From Hating to Code to Becoming Passionate About Coding</h2>\n<p>My parents made a huge mistake when I was 15 years old. They got me my first computer (This was not a mistake), but then they put me in a beginners course to learning computers. Turns out, it was a programming course. Yup, it was a bad idea for a kid like me, who didn't know how to use a computer yet. Well, they didn't know any better. They trusted the lady who recommended the course. I went through the agony \"<strong>Trying</strong>\" to learning programming when I actually didn't even know the basics of computers. It was brutal</p>\n<ul>\n  <li>The instructions went over my head,</li>\n  <li>I could not understand the assignments,</li>\n  <li>My code was buggy,</li>\n  <li>It was a hit or miss to make even the simplest things to work</li>\n  <li>I would stare at the screen for hours and would be glad when the session was over.</li>\n</ul>\n<p>Thank God, the tests were multiple-choice questions! With some guessing and sneaking over other students answers, I barely passed the class. From that point on, I hated programming and thought I would never do it in my life. Subconsciously, I developed this belief <strong>\"Coding is not for me\". </strong>Exactly 10 years later, I found myself <strong>wanting </strong>to learn to code. Remember, I didn't have to learn to code, no one asked me to, somehow I badly wanted to learn to code. I chose to become a coder. I went from someone who literally hated programming, to someone who loves programming and landed a six-figure job as a first-time developer.</p>\n<h3>Self-fulfilling prophecy \"Coding is not for me\"</h3>\n<p>In early 2011, I was building a tech company. As a single-founder of the company and on a shoe-string budget. I had a single developer working for me. Funds were running out, and I didn't have a stable developer working for the company. I knew HTML and CSS (Due to my Photoshop and Web Design Background), but coding is different, very different. I was in a vulnerable state! I was running a tech startup and I didn't understand its tech. pretty bad. I didn't have a co-founder to compliment me in my skills, a technical co-founder would have been nice. This meant that I was totally not in control of how the technology ran. My different developers could:</p>\n<ol>\n  <li>lie to me on how long a certain assignment took</li>\n  <li>take down the website and hold me, hostage</li>\n  <li>be unavailable due to any emergency</li>\n  <li>simply produce the low-quality buggy application and justify how hard that bug is to fix due (hiding their poor skill-set)</li>\n</ol>\n<p>With that, I had a low budget to sustain even a single developer on a full-time basis. This forced me to learn Ruby On Rails. The framework we used for our startup at that time. Yes, at that time I was forced to learn. I bought a Rails course from Udemy, I read the Rails Tutorials on the official site, I read a popular book on rails twice and followed its instructions at least 6 times. No exaggerations. This helped me at least understand what was going on. 3-4 months into this and I still could not develop event the smallest enhancements to my web app. I didn't have the confidence, resourcefulness or the understanding to code. I was at the mercy of my developers. I could definitely conduct a conversation about coding, that would have sounded very intelligent on the surface, but honestly, I didn't have anything to show for it. I gave up on Rails in late 2013. My self-imposed belief \"<strong>Coding is not for me</strong>\" became a self-fulfilling prophecy.</p>\n<h3>Discovering JavaScript</h3>\n<p>There is a beautiful stopwatch app, I installed from the Chrome App Store. I really like it since it helps me stay productive. This app was missing a feature. What if I could record my tasks while I time myself. The task feature was missing from this stopwatch app. I thought to myself, what if I created my own app with this feature that I want to be included. On second thought I said, \"forget it, Aziz, you can design websites, but <strong>coding an app is not for you.</strong><strong>\"</strong></p>\n<p>Self-imposed belief talked me out of it once again. Around the same time, I stumbled upon a course on jQuery - a popular JavaScript library which is very easy to use. I don't know what had me take that course, but I took it. Immediately, for the first time in my life, the instructions made sense to me. I could internalize the concepts. If my code broke, I could easily troubleshoot and fix the problem. It clicked for me. Part of the reason is that JavaScript is a very flexible language, and when used correctly, it can make you a very powerful developer. Due to my fear of coding, I had avoided JavaScript as well. Besides, historically JavaScript had a bad rep in the developer community. But since the launch of Douglas Crockford's book \"JavaScript: The Good Parts\" in 2008, the JavaScript community was getting the attention it deserved. Not just that, Node JS was getting popular in the community. Node JS enabled JavaScript to be run outside the browser, like any other language. This meant that now JavaScript could be used to replace tasks done with Ruby, Python, Java, C#, Php, Go, Perl or any other language imaginable. Listen: This is not a small thing, its a breakthrough. Typically you need to know HTML, CSS, JavaScript plus another server-side language (ruby, python, C#, PHP etc.) to build a full-fledged application. Now you don't have to learn anything more than HTML CSS and JavaScript.Plus, if you use this stack only, You can build Windows 8 Apps, Kiosk App (Like I built for United Airlines Airport terminal), TV App, Mobile App, Web Application. You name it. HTML CSS and JavaScript combination is the most powerful and versatile web stack.</p>\n<h3>The tables turned, I wanted to Learn to Code Now</h3>\n<p>Now I wanted to learn to code, I wanted to build that StopWatch Task app, I wanted to be fully express my ideas because now I saw I could be that person who can actually realize my ideas into reality without relying on other people and without going through the agony of hiring. I was the master of my journey and destiny again. But there was a problem. There was not a single resource on the internet that could teach me JavaScript in a structured way - In a way that the learning gets internalized fast. Just like that jQuery course! I searched for months, read many blogs, tutorials and exercise, but I could not get confidence. That is when I subconsciously began to distinguish patterns on what makes a great developer, vs what makes a developer wannabe. I began to learn and implement my code in a structured manner, and soon got the confidence to update my resume, and start interviewing. At that point, I also came up with the Idea of iLoveCoding. A website that would teach in a way the got me to love coding, in a way that speeds up learning, in a way that makes a developer great.</p>\n<blockquote>Your path could be faster. What I learned from my journey to learn to code, is all in iLoveCoding. Join iLoveCoding today, and accelerate your path to becoming a competent developer.</blockquote>","createdIso":{"$date":"2015-10-17T22:29:13.444Z"},"createdMsec":1.445120953444E+12,"updatedIso":{"$date":"2018-11-29T00:15:39.528Z"},"updatedMsec":1.543450539529E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5622caec8795649145fce175"},"slug":"resources","title":"Tools and Resources (I recommend)","bodyContent":"<p>These are the tools I recommend. They are all highly vetted. This means that either I have personally tried these tools, or have seen some of my trusted colleagues use them successfully.</p><p>You are at the right website. You will get honest and straightforward advice here 😃.</p>\n<h2>4 tools you must install</h2><hr>\n<p>As an aspiring and thriving JavaScript developer, you will need the following tools installed on your computer.</p>\n<h3>1) Text Editor (Aka Code Editor)</h3>\n<p>This is the tool you use to actually code in. There are many good tools out there, many of them are free.</p><p>Pick one, install it:</p>\n<ul>\n<li><a href=\"https://code.visualstudio.com/\">VS Code</a> - I use this and love it</li>\n<li><a href=\"https://atom.io/\">Atom</a></li>\n<li><a href=\"https://www.sublimetext.com/\">Sublime Text</a></li>\n<li><a href=\"http://brackets.io/\">Brackets</a></li>\n<li><a href=\"https://www.jetbrains.com/webstorm/\">Web Storm</a></li>\n</ul>\n<h3>2) <a href=\"https://www.google.com/chrome/\">Google Chrome</a></h3>\n<p>For any serious web developer, you must have Google Chrome installed. Here is why. The Google Chrome browser is (a) fast, (b) is kept up to date, and (c) comes pre-installed with a powerful set of Developer Tools. This helps us, developer, troubleshoot and debug the applications we build. It's a must-have.</p><p>If you are not using Google Chrome, you are not serious about your skills in web development.</p>\n<h3>3) <a href=\"https://nodejs.org/\">Node.js</a></h3>\n<p>Node.js is actually a JavaScript runtime. Its just a tool that sits on our computer, and we use it to process our code.</p>\n<p><a href=\"https://ilovecoding.org/courses/nodejs\">For a crash course on Node.js, click here.</a></p>\n<h3>4) <a href=\"https://www.getpostman.com/\">Postman</a></h3>\n<p>With Postman we can make different HTTP requests and clearly see the response. This tool is very handy when building or integrating with APIs.</p>\n<h2>Learning References</h2>\n<hr>\n<p>Coders are builders, problem solvers, and troubleshooters.&nbsp;<i>We are NOT memorizers.</i></p>\n\n\n<blockquote class=\"blockquote\">\n  <p>\"Do not commit to memory anything that can be looked up in a book\"</p>\n  <footer class=\"blockquote-footer\"><cite title=\"Source Title\">Albert Einstein</cite></footer>\n</blockquote>\n\n<p>With that said, it's important that you keep these resources handy to lookup documentation and details about any feature you are trying to learn.</p>\n<h3><a href=\"https://developer.mozilla.org/en-US/\">Mozilla documentation</a></h3><p>This is the most authentic site for looking up documentation on web technology. References for HTML, CSS, and JavaScript are all documented pretty well here.</p>\n<p><b>Important:</b> I never go to the Mozilla documentation directly. I usually google something like this:&nbsp;\"javascript array mozilla\"&nbsp;and then click on the link from Mozilla's website.</p>\n<h3><a href=\"https://www.w3schools.com/\">W3Schools.com</a></h3>\n<p>Although I don't use this, many of my students find W3 Schools helpful. I must say that they have simple terminology and a helpful demo of code. Its a great reference for newbies.</p><p>As you become more proficient, you must start relying on Mozilla more than W3 Schools.</p>\n<h2>Web Hosting</h2><hr>\n<h3><a href=\"https://www.netlify.com/\">Netlify</a></h3>\n<p>iLoveCoding Front-End is hosted with Netlify. It's free, fast, and integrates with Github and Bitbucket. It's pretty awesome. They have a ton of features and tools that make hosting easy and a peace of mind.</p><p>I actually just code my website and push it to Bitbucket and my website changes automatically get live. They have more handy features like that.</p>\n<h3><a href=\"https://www.siteground.com/?referrer_id=7300472\">SiteGround</a></h3><p>Great for WordPress hosting and general purpose website hosting.</p>\n<h3><a href=\"https://heroku.com\">Heroku</a></h3><p>Heroku is a platform as a service. That means that they take care of the servers, performance logging and all. You simply deploy your app and they simply deploy it live. I love it. iLoveCoding backend is hosted with Heroku.</p>\n<h3><a href=\"https://aws.amazon.com/\">Amazon Web Services (AWS)</a></h3>\n<p>There is all this craze about AWS, but as a beginner and even intermediate developers, you may not have the need for them. They have a vast range of services. For most needs, you can easily use other more user-friendly services. API and Web back-end hosting with Heroku, and static file site hosting with Netlify or SiteGround. There I said it&nbsp;😲</p>\n<h2>Domain: Get your own (.com)</h2><hr><p>If you want your own website domain - like yourname.com (.net .org .co .io ...), you need to buy a domain from a domain registrar. Simply pay a nominal yearly fee, and register your domain.</p><p>I have used many services over the years; Below are some that I recommend:</p>\n<ul>\n<li><a href=\"http://iwantmyname.com/\">iWantMyName.com</a>&nbsp;- Simple interface and a ton of domain extensions offered</li>\n<li><a href=\"http://godaddy.com/\">Godaddy.com</a>&nbsp;- Has good phone customer service. Good if you are a newbie</li>\n<li><a href=\"https://domains.google.com/\">Google Domain</a>&nbsp;- Simple interface</li><li><a href=\"https://aws.amazon.com/getting-started/tutorials/get-a-domain/\">Amazon Web Services</a>&nbsp;- only recommended for advanced users - they make it a little complicated.</li>\n</ul>\n<p>Remember domain registrars are like domain brokers, so they are more or less a commodity. All they do is provide a DNS Server (also known as a Name Server) that has a record of your domain name information. All you care about from a domain registrar is (A) They are reliable and will not go out of business (B) They have a good Domain Name Record editing interface. (C) Price.</p>\n<h2>Design: Prototyping Ideas</h2><hr>\n<h3><a href=\"https://affinity.serif.com/en-us/photo/\">Affinity Photo</a>&nbsp;- I use this</h3>\n<p>Affinity Photo is like Photoshop but without the monthly fees. Pay once and own forever.</p>\n<h3><a href=\"https://balsamiq.com/\">Balsamiq</a></h3><p>Balsamiq is an awesome prototyping app. If you have an app idea, you can quickly mock it with Balsamiq. I don't use Balsamiq, I use Affinity Photo to do the same.</p><p>If you are not savvy with design and photoshop skills, Balsamiq is a great tool for you.</p>\n<h2>Organizing Thoughts and Projects</h2><hr><h3><a href=\"https://workflowy.com/invite/1a426780.lnx\">Workflowy</a> - I use this, a lot</h3><p>Workflowy is a simple note-taking app organized around lists. I use Workflowing for taking notes, journaling, brainstorming, and preparing all iLoveCoding video content and curriculum.</p><h3><a href=\"https://asana.com\">Asana</a> - I use this</h3><p>Asana is a project management tool. I use it to organize my days, weeks, projects, and even collaborate with my team. Asana keeps track of my tasks, deadlines, and status of those tasks. If I am collaborating on a task with my team, the comments section helps us keep all the conversation about that task in one place.</p>","createdIso":{"$date":"2015-10-17T22:25:48.496Z"},"createdMsec":1.445120748496E+12,"updatedIso":{"$date":"2020-08-21T23:43:03.456Z"},"updatedMsec":1.543624205193E+12,"active":true,"enabled":true,"subTitle":"Trusted tools and resources you need to succeed..."}
{"_id":{"$oid":"56397cb7f1d3e5193da54fa9"},"slug":"verify-new-account","title":"Verify your email","bodyContent":"","createdIso":{"$date":"2015-11-04T03:34:15.143Z"},"createdMsec":1.446608055143E+12,"updatedIso":{"$date":"2018-07-30T21:42:36.698Z"},"updatedMsec":1.532986956698E+12,"active":true,"enabled":true,"subTitle":"We just sent you an email with a verification link. Please click on that link to activate your account."}
{"_id":{"$oid":"5b346a74def3152a5d3d4f72"},"slug":"thankyou-perfect-path-2","title":"Learning How to Code is NOT Complicated","bodyContent":"<p>Yes! I said it - Learning how to code is not complicated.</p>\n<p>Now you may say but Aziz I have been trying for months or even years and I still don't get even the simple concepts.</p>\n<p>and I understand totally.</p>\n<p>From comprehensive books to cheap courses all the way to expensive coding bootcamps there are hundreds of resources to learn how to code, but still, you are struggling.</p>\n<p>You know why?</p>\n<p>Because you have been given incomplete information and sometimes misinformation.</p>\n<p>Now don't get me wrong. Some of these resources on the internet are awesome, and they mean well, but still, they are not able to help you.</p>\n<h3>My Story</h3>\n<p>You see, I struggled with learning how to code for 9 years. I took coding classes in private institutes, I took coding classes in my university, I tried a few cheap online courses, and I even paid a professional developer to teach me how to code,</p>\n<p>and none of them worked for me.</p>\n<p>But then in June of 2013, It all changed for me when I discovered a learning methodology and the right path to becoming a programmer.</p>\n<p>And part of that was picking the right programming language.</p>\n<p>From that point, my things changed.</p>\n<p>I went from someone who struggled with coding to become a professional developer in 5 months. At the end of 5 months, I landed a job at United Airlines as a professional software developer.</p>\n<p>It was such a relief, I felt successful, I felt I was not dumb. It was a huge confidence booster for me.</p>\n<p>Since then I have worked at CVS Caremark, Press Ganey (a big healthcare analytics company) and Uptake (a billion dollar high startup in Chicago), building websites, web apps and mobile apps for them.</p>\n<p>And in this email course, I want to give you the same breakthroughs I got.</p>\n<h3>So here is what we will discuss in this email course.</h3>\n<p><strong>Lesson #1: Pick the best programming language</strong></p>\n<p>In lesson #1 I will show you which programming language you should learn and which ones you should ignore.</p>\n<p>This is very important.</p>\n<p>There is so much hype on the internet about different programming languages, and quite honestly its distracting you from being successful.</p>\n<p>There is Python, Java, Ruby, C#, JavaScript, and so many other programming languages.</p>\n<p>There is so much misinformation.</p>\n<p>In this lesson I will give you the facts of each of these programming languages and show you which programming language you should learn and which ones you should ignore and why (with proof.)</p>\n<p><strong>Lesson #2: Intro to HTML</strong></p>\n<p>I will give you an introduction to HTML, this is the language that is used to build websites.</p>\n<p>Now if you already know HTML, great but I insist you attend this lesson too because in this I will not only show you the basics of HTML, we will also launch our first simple little websites live using the same tool I use at iLoveCoding. And yes that tool is free.</p>\n<p>In this lesson you will have your first website live, so your friends are jealous and your parents are proud of you.</p>\n<p><strong>Lesson #3: Intro to CSS</strong></p>\n<p>In this lesson I will give you a quick introduction to CSS, this is a language to make your websites look beautiful</p>\n<p><strong>Lesson #4: Intro to JavaScript</strong></p>\n<p>In this lesson, I will give you an introduction to JavaScript. The programing language that powers 98% of the internet, plus its is heavily used by Facebook, Paypal, Walmart, LinkedIn to power their websites as well.</p>\n<p>In this lesson, you will write your first line of code. You will see first hand why programming is not that difficult after all when explained simply.</p>\n<p><strong>Lesson #5: More JavaScript</strong></p>\n<p>In this lesson, we will continue with javascript and learn how to make a simple and intelligent application with it.</p>\n<p>This will be a simple exercise to give you an exposure to coding</p>\n<p><strong>Lesson #6: The Perfect Roadmap to becoming a developer (What I did)</strong></p>\n<p>In this lesson, I will show give you the roadmap I used to become a software developer in 5 months.</p>\n<p>- This roadmap will tell you what to learn, how to learn and where to learn it from.</p>\n<p>I will walk you through my roadmap and tell you why it's so effective for newbies and experienced people alike.</p>\n<p>Its great for getting you a respectable job and its awesome for entrepreneurs who want to build their own apps and startups.</p>\n<p><strong>Lesson #7:&nbsp;The Simple Learning Technique</strong></p>\n<p>In this lesson, I will share a universal learning technique that helped me learn to programme while building my portfolio.</p>\n<p>This learning technique was pivotal to my success - so you don't want to miss this lesson.</p>\n<p>One last thing. I honestly want you to be successful. The biggest achievement of a mentor is to see his students succeed. And It would make me personally happy to see you succeed.</p>\n<p>With that said, go to your email inbox, you should have received your first lesson.</p>\n<p>Go study it, its short and to the point.</p>\n<p>That's it for now, Talk to you in lesson #1</p>","createdIso":{"$date":"2018-06-28T04:53:29.427Z"},"createdMsec":1.530161736609E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2018-11-29T00:31:14.304Z"},"updatedMsec":1.543451474304E+12}
{"_id":{"$oid":"5622a3f8f6e8e7a52a477111"},"slug":"privacy","title":"Privacy","bodyContent":"<p>Your privacy is very important to us. Accordingly, we have developed this policy in order for you to understand how we collect, use, communicate, disclose and make use of personal information. The following outlines our privacy policy.</p><ul><li>Before or at the time of collecting personal information, we will identify the purposes for which information is being collected.</li><li>We will collect and use personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law.</li><li>We will only retain personal information as long as necessary for the fulfillment of those purposes.</li><li>We will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned.</li><li>Personal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date.</li><li>We will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification.</li><li>In the event of a data security breach, we will inform the concerned as soon as possible.</li><li>We will make readily available to customers information about our policies and practices relating to the management of personal information.</li><li>We use third-party software tools to manage your personal information, however, these third-party tools are not authorized to use your personal information in any way. They just facilitate the information management aspect.</li><li>We do not share your&nbsp;personal information with any third-party beyond the scope of the purpose&nbsp;why your information was collected.</li></ul><p>We are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.</p>","createdIso":{"$date":"2015-10-17T19:39:36.063Z"},"createdMsec":1.445110776063E+12,"updatedIso":{"$date":"2018-11-30T20:05:32.225Z"},"updatedMsec":1.543608332225E+12,"active":true,"enabled":true,"subTitle":""}
{"_id":{"$oid":"58439943606b9b0010c92f64"},"slug":"confirmed-5-day-email-course-3x-learning-speed","title":"Congrats! You Are Enrolled","bodyContent":"<p style=\"text-align: center;\">You are enrolled in the 5-Day Email Course to 3x Your Speed to Becoming a Developer.</p><p style=\"text-align: center;\"><img src=\"http://i.giphy.com/3o6Zt7mutmbv76m0ko.gif\" style=\"width: 50%;\"><br></p><p style=\"text-align: center;\">The course will be delivered&nbsp;via email, one email a day for 5 days.</p><p style=\"text-align: center;\">So, keep an eye in your inbox</p><p></p><div style=\"text-align: center;\"><span>Your Code Mentor<br>Aziz Ali</span></div><div style=\"text-align: center;\"><span>Creator of iLoveCoding.org</span></div><p><br></p><p></p>","createdIso":{"$date":"2016-12-04T04:19:15.208Z"},"createdMsec":1.480825155217E+12,"updatedIso":{"$date":"2018-11-29T00:32:30.504Z"},"updatedMsec":1.543451550504E+12,"active":true,"enabled":true}
{"_id":{"$oid":"5b5de704f1020c0014e51b47"},"slug":"how-it-works","title":"How iLoveCoding works?","bodyContent":"<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/311500556\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n\n<p><strong>Here is how iLoveCoding works:</strong></p>\n<h3>1. iLoveCoding is Complete</h3>\n<p>There is a reason why learning how to code is broken. Cheap online courses are incomplete and focus on only a few parts of becoming a programmer.</p>\n<p>On the other hand coding bootcamps focus on too many things and only cover the surface. If the coding bootcamp is any good, they are super expensive and overwhelming for students.</p>\n<p>iLoveCoding solves both of these problems. iLoveCoding takes you from a newbie into a confident software developer via my <strong>Perfect Plan</strong>.</p>\n<p><strong>The Perfect Plan</strong> covers the foundations of programming and web technology. You learn the basics of HTML, CSS, JavaScript, and learn how to build simple and complex web and mobile applications.</p>\n<p>You learn how to think like a developer so you can architect the perfect app.</p>\n<p>Next, I teach some JavaScript frameworks. These frameworks are in high-demand and will help you make modern web and mobile apps. You will learn frameworks like Express.js, Node.js, React, jQuery, and more. These are the same technologies used by PayPal, Facebook, Airbnb, Tesla, Microsoft, and many other smaller companies.</p>\n<p><strong>While learning we build a ton of projects.&nbsp;</strong> There is a dedicated section called <strong>Practice Projects.</strong> These are video training on how to apply your learning to build real-world apps and features. You see, the fundamentals of web and programming do not change, but it's eye-opening to see HOW to apply those same programming fundamentals to build impressive apps. That's where <strong>Practice Projects</strong> comes in. Select any <strong>Practice Project</strong>, watch the lessons, and then try to build the same app while following along.</p>\n<p>When you copy/follow along with these lessons, you will subconsciously internalize my thought process and see how to think and build like a developer.</p>\n<h3>2. iLoveCoding is <strike>Different</strike> Better</h3>\n<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/311500900\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n<h4><em>A. Simple Terminology</em></h4>\n<p>Most college professors, bootcamp instructors, and even online courses miss this. They use complicated terminology and skip through the important details. I don't do that to you.</p>\n<p>I believe in the saying:</p>\n<blockquote><em>\"If you can't explain it simply, you don't understand it yourself\" - Albert Einstein</em></blockquote>\n<p>You see, all knowledge is acquired incrementally. Before I introduce a new terminology (or a new concept), I will first explain to you what that is. Once you understand that, then and only then, I will proceed on to teaching you other things.</p>\n<p>Secondly, I repeat and re-clarifying the concepts that I teach you. For instance, I will introduce a programming concept in video 7, and then let's say that the same concept is being used in video 12, I will recap that concept quickly and then proceed. This way your knowledge is refreshed along the way.</p>\n<h4><em>B. Focus on the right programming language - JavaScript</em></h4>\n<p>One of the biggest problems in the learn-to-code space is that different courses and bootcamps are pushing their own agenda and teaching the wrong programming languages. You see all programming languages are good, however, if you want to build different kinds of apps and have a profitable long-term career then JavaScript should be your first programming language. I go in detail <strong>why this is important here</strong></p>\n<p>With iLoveCoding, you learn JavaScript and its popular frameworks.</p>\n<p>This is the fastest and the smartest way to build fully functional Web Apps, Websites, Mobile Apps, and even Desktop Apps.</p>\n<p>No other programming language can match this capability.</p>\n<p>JavaScript is the most versatile programming language, and is the most popular as well - Meaning? getting a job is easier!</p>\n<h3>3. Connect with students</h3>\n<p>iLoveCoding students at all levels get access to a private Facebook Group and a private Slack channel. This way you can connect with peers, ask questions, and get support.</p>\n<h3>4. Get mentor support</h3>\n<p>iLoveCoding Premium members get personalized support from a dedicated mentor. Getting stuck is a part of the journey. A mentor will guide you and point you in the right direction. This will accelerate your growth and give you confidence in your journey.</p>\n<p>Everything you get with iLoveCoding</p>\n<h2>What will you learn?</h2>\n<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/311500783\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n<p><strong>Foundation</strong></p>\n<ul>\n  <li>How do programming languages work?</li>\n  <li>Which programming language should you pick?</li>\n  <li>How the web and the internet works?</li>\n  <li>How to launch simple and complex websites?</li>\n</ul>\n<p><strong>Web &amp; Programming Fundamentals</strong></p>\n<ul>\n  <li>How to build simple websites with HTML &amp; CSS?</li>\n  <li>Learn modern JavaScript and all its fundamentals</li>\n  <li>Learn how to JavaScript is used to build web, mobile &amp; desktop apps</li>\n  <li>How to think like a developer?</li>\n  <li>How to remember new programming concepts?</li>\n  <li>How to learn when to use which coding concepts?</li>\n  <li>How to put your website live with your own domain (.com)?</li>\n</ul>\n<p><strong>Modern Web Development: Front-End</strong></p>\n<ul>\n  <li>How to build modern Web UI with jQuery and React?</li>\n  <li>How do browser works and how to tame it?</li>\n  <li>How to build interactive features like Tabs, Animation, Scroll Effects, Sliders and more.?</li>\n  <li>How to integrate your app with Facebook, Wikipedia, or Google API?</li>\n</ul>\n<p><strong>Modern Web Development: Back-End &amp; Databases</strong></p>\n<ul>\n  <li>How to build a website backend?</li>\n  <li>How to build traditional websites &amp; modern Web APIs?</li>\n  <li>How to secure your content with Login and authentication?</li>\n  <li>How to create CRUD applications?</li>\n  <li>How to create apps like Facebook, Twitter, Reddit, Quora, etc?</li>\n</ul>\n<p><strong>Mobile App Development</strong></p>\n<ul>\n  <li>How to build Android and iOS Apps with React Native?</li>\n  <li>How to code once and build apps for both platforms?</li>\n  <li>How to connect your mobile app with any back-end (including Third-party)?</li>\n</ul>\n<p><strong>Build Impressive Projects</strong></p>\n<ul>\n  <li>How to come up with portfolio ideas?</li>\n  <li>Select from a ton of <strong>Practice Projects</strong> and build</li>\n</ul>\n<p><strong>Get a Job as a Developer</strong><br>\nOne of my (Aziz) strengths is getting a job. You can always ping me an ask specific questions on the following:</p>\n<ul>\n  <li>Winning Resume Template</li>\n  <li>Interview Preparation Guide&nbsp;</li>\n  <li>Salary Negotiation Formula</li>\n</ul>\n<h2>What will you build?</h2>\n<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/311500669\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>\n<p>Once you learn the foundation concepts of any technology, its crucial that we apply our learning to build real-world apps and features.</p>\n<p>You get step-by-step video training on how to build the following:</p>\n<ul>\n  <li>Song Search App built powered by iTunes</li>\n  <li>Beautiful Blog Design</li>\n  <li>StopWatch App</li>\n  <li>Rock Paper Scissor Game</li>\n  <li>Snake Game</li>\n  <li>To-Do List App</li>\n  <li>Find Your Location App</li>\n  <li>Image Slider Feature</li>\n  <li>Tab Feature</li>\n  <li>Sticky Top Bar Feature</li>\n  <li>Calculator App</li>\n  <li>Timer Application</li>\n  <li>Note-Taking App</li>\n  <li>Login Feature</li>\n  <li>Cryptocurrency Price Checker (Android/iOS App)</li>\n  <li>Show on Scroll Effect</li>\n  <li>Full Background Video</li>\n  <li>Full Background Image</li>\n</ul>","createdIso":{"$date":"2018-07-29T16:10:44.479Z"},"createdMsec":1.532880644479E+12,"active":true,"enabled":true,"updatedIso":{"$date":"2020-08-21T22:57:58.456Z"},"updatedMsec":1.54345124511E+12,"subTitle":"iLoveCoding is a video-based training program that transforms you into a confident Software Engineer - No CS degree required!"}
{"_id":{"$oid":"5fc70c113391d0001745d574"},"slug":"welcome-full-stack-mastery","title":"🎉  Congratulations! Your purchase is complete","subTitle":"","bodyContent":"<p>I want to personally welcome you to iLoveCoding Full-Stack Mastery,</p>\n<p>Trust me, you have made a fine decision to embark on this journey, the results of which will pay you handsome dividends in many years to come in your career as well as in your personal life.</p>\n<p>With this training, your brain will perform more efficiently and with more clarity.</p>\n<p>You will break down problems in more manageable chunks and solve them with relative ease.</p>\n<h3>Now let's get started:</h3>\n<p>If you are totally new to iLoveCoding, <strong>go to your email inbox</strong>, check for an email from iLoveCoding, and <strong>Activate your account</strong></p>\n<p>If you are an existing iLoveCoding member who just upgraded your account, <a href=\"https://ilovecoding.org/login\">proceed to Login</a></p>\n<p><br></p>\n<p>When in doubt, reach us at <a href=\"mailto:support@ilovecoding.org\">Support@iLoveCoding.org</a></p>","createdIso":{"$date":"2020-12-02T03:37:53.668Z"},"updatedIso":{"$date":"2020-12-21T18:56:28.508Z"}}
{"_id":{"$oid":"5c33cdb9a585a3001443e26b"},"slug":"thanks-perfect-path","title":"🎉 Congratulations, you're enrolled!","subTitle":"One last thing... Check your inbox and confirm your email","bodyContent":"<h3>Now you just need to do one last thing...</h3>\n<p>You should have received an email from me to confirm that we got your email correctly.</p><p></p><ol><li>Check your email inbox</li><li>Open the email from me <b>\"Aziz at iLoveCoding\"</b></li><li>Click the big button to confirm your email</li><li>Get access to the course&nbsp;💪</li></ol>\n\n<div class=\"video\"><iframe src=\"https://player.vimeo.com/video/310663669?title=0&amp;byline=0&amp;portrait=0\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe></div>","createdIso":{"$date":"2019-01-07T22:07:53.826Z"},"updatedIso":{"$date":"2019-01-11T16:10:37.399Z"}}
{"_id":{"$oid":"630291a99e45ff8bf98cb1e9"},"slug":"welcome-front-end-professional","title":"🎉  Congratulations! Your purchase is complete","subTitle":"","bodyContent":"<p>I want to personally welcome you to iLoveCoding Front-End Professional,</p>\n<p>Trust me, you have made a fine decision to embark on this journey, the results of which will pay you handsome dividends in many years to come in your career as well as in your personal life.</p>\n<p>With this training, your brain will perform more efficiently and with more clarity.</p>\n<p>You will break down problems in more manageable chunks and solve them with relative ease.</p>\n<h3>Now let's get started:</h3>\n<p>If you are totally new to iLoveCoding, <strong>go to your email inbox</strong>, check for an email from iLoveCoding, and <strong>Activate your account</strong></p>\n<p>If you are an existing iLoveCoding member who just upgraded your account, <a href=\"https://ilovecoding.org/login\">proceed to Login</a></p>\n<p><br></p>\n<p>When in doubt, reach us at <a href=\"mailto:support@ilovecoding.org\">Support@iLoveCoding.org</a></p>","createdIso":{"$date":"2020-12-02T03:37:53.668Z"},"updatedIso":{"$date":"2020-12-21T18:56:28.508Z"}}
{"_id":{"$oid":"5b252d69f0e5cd0014c24050"},"slug":"thanks","title":"Thank you, your action has been recorded","bodyContent":":-)","createdIso":{"$date":"2018-06-16T15:31:53.189Z"},"createdMsec":1.529163113191E+12,"updatedIso":{"$date":"2018-06-16T15:31:02.566Z"},"updatedMsec":0,"active":true,"enabled":true}
